Revit 2024 API
WorksharingUtils Methods
The WorksharingUtils type exposes the following members.
Methods
Name | Description
CheckoutElements(Document, ICollection<ElementId>)
 Obtains ownership for the current user of as many specified elements as possible.
CheckoutElements(Document, ISet<ElementId>, TransactWithCentralOptions)
 Obtains ownership for the current user of as many specified elements as possible.
CheckoutWorksets(Document, ICollection<WorksetId>)
 Obtains ownership for the current user of as many specified worksets as possible.
CheckoutWorksets(Document, ISet<WorksetId>, TransactWithCentralOptions)
 Obtains ownership for the current user of as many specified worksets as possible.
CreateNewLocal
 Takes a path to a central model and copies the model into a new local file for the current user.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCheckoutStatus(Document, ElementId)
 Gets the ownership status of an element.
GetCheckoutStatus(Document, ElementId, String)
 Gets the ownership status and outputs the owner of an element.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModelUpdatesStatus
 Gets the status of a single element in the central model.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetUserWorksetInfo
 Gets information about user worksets in a workshared model file, without fully opening the file.
GetWorksharingTooltipInfo
 Gets worksharing information about an element to display in an in-canvas tooltip.
RelinquishOwnership
 Relinquishes ownership by the current user of as many specified elements and worksets as possible, and grants element ownership requested by other users on a first-come, first-served basis.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
WorksharingUtils Class
Autodesk.Revit.DB Namespace